# **Отчёт по лабораторной работе № 13** по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Галкин Алексей Дмитриевич, № по списку 3</ins> 

<b>Контакты e-mail:</b> <ins>alexgalkin2004@mail.ru</ins>

<b>Работа выполнена:</b> «24» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>5</ins>

<b>Отчет сдан</b> «26» <ins>ноября<ins>2022</ins> г., <b>итоговая оценка</b> <ins>5 (отлично)</ins>

<b>Подпись преподавателя:</b> ________________  

## 1. Тема
Множества

## 2. Цель работы
Составить программу на языке Си, выполняющую анализ и обработку вводимого текста в соответствии с выданным вариантом задания
## 3. Задание (Вариант №3)
Узнать, есть ли слово, хотя бы одна гласная которого повторяется.
## 4. Оборудование
<b>Процессор:</b> 11th Gen Intel(R) Core (TM) i7-11370H 3.30GHz<br/>
<b>ОП: 16ГБ <br/>
<b>Монитор: 2880x1800 <br/>
## 5. Програмное обеспечение
<b>Опереционная система семейства: VirtualBox 6.1.38 - Ubuntu 22.04.01 LTS<br/>
<b>Интерпретатор команд:</b> bash, версия 5.1.16<br/>
<b>Система программирования:</b> --, версия --<br/>  
<b>Редактор текстов:</b> emacs, версия **28.2**<br/>
<b>Утилиты операционной системы:</b> gcc,cat<br/>
<b>Прикладные системы и программы:</b>--<br/>
<b>Местанохождение и имена файлов программ и данных на домашнем компьютере:</b> home/alexey<br/>
## 6. Идея, метод, алгоритм
1. Создаём множество гласных букв из латинского алфавита и назовём его «VOWELS». Введём два состояния: «OUT» (находимся вне слова) и «IN» (находимся в слове) и множество «set», в котрое будем заносить все считываемые символы.
2. Через getchar читаем каждый символ. Если он не равен концу файлу, то есть 2 варианта. Если текущее состояние «OUT», то переходим к 3 пункту — иначе к 4.
3. Обнуляем множество «set», и если символ не является разделителем, то переходим в состояние «IN» и в следующий пункт, в противном случае читаем следующий символ.
4. Если символ — буква из алфовита, то добавляем во множество символ, потом оставляем в множестве «set» только гласные буквы с помощью пересечения со множеством «VOWELS». Дальше проверяем на пересечение множества «set» (в котором остались только гласные) и очередного символа. Если множества пересекаются, то гласная повторяется. И если символ становится разделителем, то перехлдим в состояние «OUT».  
## 7. Сценарий выполнения работы
1. Скомпилируем при помощи команды gcc программу lab13.c.
2. Компилятор сообщит об ошибке, если она присутствует.
3. Запустим файл a.out через команду ./a.out < 
4. Введём любой ряд чисел
Тесты: 
  
| № | Ввод | Вывод |
| ------ | ------ | ------ |
| 1 | da | There are not similar vowels |
| 2 | HOWTOWIN | Repeat of vowel O|
| 3 | MAI is the best University | Repeat of vowel i |
| 4 | 12345678 | There are not similar vowels |

Код:
```
#include <stdio.h>
#include <ctype.h>

#define VOWELS ( \
    1U << ('a' - 'a') | \
    1U << ('e' - 'a') | \
    1U << ('i' - 'a') | \
    1U << ('o' - 'a') | \
    1U << ('u' - 'a') \
)
char Repeat_of_vowels();
enum State{
    OUT,
    IN
};

unsigned int char_to_set(char c) {
    c = tolower(c);
    if (c < 'a' || c > 'z') {
        return 0;
    } else {
        return 1u << (c-'a');
     }
}
int main() {
    printf("%c\n", Repeat_of_vowels());
    return 0;
}    

char Repeat_of_vowels(){
    enum State state = OUT;
    int  c;
    unsigned int set = 0;
    while ((c = getchar()) != EOF){
        switch (state) {
        case OUT:
            set = 0;
            if (isspace(c) || (c == '\t') || (c == '\n'))
                break;
            state = IN;
        case IN:
            if (isalpha(c)){
                if (set & char_to_set(c)){
                    printf("Repeat of vowel %c\n",(char) c);
                    return 0;
                }
                set = set | char_to_set(c);
                set = set & VOWELS;
                break;
            
            }
            else{
                state = OUT;
            }
        }
    }
    printf("There are not similar vowels");
    return 0;
}

                                  
```
Пункты 1-7 отчета составляются строго до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________
### 8. **Протокол**
```

```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 16.11.22 | 14:00 | Выполнение лабораторной работы | - | - |    
## 10. Замечания автора по существу работы
—
## 11. Выводы
Была изучена работа со множествами на языке Си.
  
