# **Отчёт по лабораторной работе № 11** по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Галкин Алексей Дмитриевич, № по списку 3</ins> 

<b>Контакты e-mail:</b> <ins>alexgalkin2004@mail.ru</ins>

<b>Работа выполнена:</b> «10» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>5</ins>

<b>Отчет сдан</b> «12» <ins>ноября<ins>2022</ins> г., <b>итоговая оценка</b> <ins>5 (отлично)</ins>

<b>Подпись преподавателя:</b> ________________  

## 1. Тема
Обработка последовательности литер входного текстового файла. Простейшие приёмы лексического анализа. Диаграммы состояний и переходов.

## 2. Цель работы
Составить программу на языке Си, выполняющую анализ и обработку вводимого текста в соответствии с выданным вариантом задания
## 3. Задание (Вариант №3)
Подсчитать число слов в комментариях ({ и } или (* и *)) в программе на Паскале
## 4. Оборудование
<b>Процессор:</b> 11th Gen Intel(R) Core (TM) i7-11370H 3.30GHz<br/>
<b>ОП: 16ГБ <br/>
<b>Монитор: 2880x1800 <br/>
## 5. Програмное обеспечение
<b>Опереционная система семейства: VirtualBox 6.1.38 - Ubuntu 22.04.01 LTS<br/>
<b>Интерпретатор команд:</b> bash, версия 5.1.16<br/>
<b>Система программирования:</b> --, версия --<br/>  
<b>Редактор текстов:</b> emacs, версия **28.2**<br/>
<b>Утилиты операционной системы:</b> gcc,cat<br/>
<b>Прикладные системы и программы:</b>--<br/>
<b>Местанохождение и имена файлов программ и данных на домашнем компьютере:</b> home/alexey<br/>
## 6. Идея, метод, алгоритм
  1. Открываем файл hw.pas с кодом, написанным на языке Паскаль, через команду </b>getchar<br/>
  2. Через переменную c читаем файл, пока он не закончится (пока c != EOF).
  3. Так как у нас есть два вида комментария, то делаем 2 проверки для многострочных комментариев через {} и 1 проверку для однострочных    коммаентариев через *. (Не будем проверять закрытие однострочного комментария, так как программа на языке Паскаль выдаст ошибку, если она не закрыта)
  4. В самом комментарии с помощью </b>isalpha<br/> из библиотеки ctype.h проверяем, когда встретится и закончится слово в комментарии. Когда встретиться пробел (проверим с помощью команды </b>isspace<br/>) прибавляем к количеству слов 1.
  5. Повторяем 3-4 пункты, пока не закончится файл.
## 7. Сценарий выполнения работы
1. Скомпилируем при помощи команды gcc программу lab11.c.
2. Компилятор сообщит об ошибке, если она присутствует.
3. Запустим файл a.out с входным файлом hw.pas через команду ./a.out < hw.pas
Код:
```
#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>

int main () {
    char c;
    int a = 0, k = 1, i, t = 0, q = 0, e = 1;
    while ((c = getchar()) != EOF){
        if ((c == '{') & (k == 1) & (e == 1)) {
            k = 2;
            a = t;
        }
        if ((k == 2) & (c == '}')){
            k = 1;
        }
        if ((isalpha(c) != 0) & (k == 2)) { 
            q = 1;
        }
        if ((isspace(c) != 0) & (q == 1)){
            q = 0;
            t++;
        }
        if ((c == '*') & (k == 1) & (e == 1))
            e = 2;
        else if ((e == 2) & (c == '\n')){
            e = 1;   
        }
        if ((isalpha(c) != 0) & (e == 2)) { 
            q = 1;
        }
    }
    
    if (k == 2){
        printf("Comment is still open\n");
        return 0;
    }
    printf("Word count  = %d\n", t);
    return 0;
}
                                                                             
```
Пункты 1-7 отчета составляются строго до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________
### 8. **Протокол**
```

```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 12.11.22 | 13:00 | Выполнение лабораторной работы | - | - |    
## 10. Замечания автора по существу работы

## 11. Выводы
Был изучен способ отладки программ, написанных на языке Си. 
  
