# **Отчёт по лабораторной работе № 15** по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Галкин Алексей Дмитриевич, № по списку 3</ins> 

<b>Контакты e-mail:</b> <ins>alexgalkin2004@mail.ru</ins>

<b>Работа выполнена:</b> «7» <ins>декабря</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>5</ins>

<b>Отчет сдан</b> «8» <ins>декабря<ins>2022</ins> г., <b>итоговая оценка</b> <ins>5 (отлично)</ins>

<b>Подпись преподавателя:</b> ________________  

## 1. Тема
Обработка матриц
## 2. Цель работы
Составить программу на языке Си, производящую обработку квадратной матрицы порядка NxN (1<=N<=8), из целых чисел, вводимой из стандартного входного текстового файла.
## 3. Задание (Вариант №3)
Перестановка столбцов с максимальной и минимальной суммой элементов (с минимальными номерами соответственно).

## 4. Оборудование
<b>Процессор:</b> 11th Gen Intel(R) Core (TM) i7-11370H 3.30GHz<br/>
<b>ОП: 16ГБ <br/>
<b>Монитор: 2880x1800 <br/>
## 5. Програмное обеспечение
<b>Опереционная система семейства: VirtualBox 6.1.38 - Ubuntu 22.04.01 LTS<br/>
<b>Интерпретатор команд:</b> bash, версия 5.1.16<br/>
<b>Система программирования:</b> --, версия --<br/>  
<b>Редактор текстов:</b> emacs, версия **28.2**<br/>
<b>Утилиты операционной системы:</b> gcc,cat<br/>
<b>Прикладные системы и программы:</b>--<br/>
<b>Местанохождение и имена файлов программ и данных на домашнем компьютере:</b> home/alexey<br/>
## 6. Идея, метод, алгоритм
1. Будем считывать число n (размерность матрицы), пока не считаем конец файла. 
2. Зададим значения переменным max и min INT_MIN и INT_MAX соответственно.
4. Находим сумму элементов каждого столбца. Сравниваем эту сумму с min и max. Если сумма меньше min, то приравниваем min к сумме. Если сумма больше max, то приравниваем max к сумме. Заносим номера столбцов с min и с max в переменные min_column и max_column.
5. Меняем местами значения из столбца max_column со столбцом min_column
  
## 7. Сценарий выполнения работы
Тесты: 
Ввод:    
4    
| 1 | 2 | 3 | 4 | 
| -- | -- | -- | -- |
| 5 | 6 | 7 | 8 | 
| 9 | 10 | 11 | 12 |
| 13 | 14 | 15 | 16 |    

Ввывод:    
| 4 | 2 | 3 | 1 | 
| -- | -- | -- | -- |
| 8 | 6 | 7 | 5 | 
| 12 | 10 | 11 | 9 |
| 16 | 14 | 15 | 13 | 

Ввод:    
6    
| 1 | 2 | 3 | 4 | 5 | 6 | 
| -- | -- | -- | -- | -- | -- |
| 7 | 8 | 9 | 10 | 11 | 12 | 
| 13 | 14 | 15 | 16 | 17 | 18 | 
| 19 | -20 | 100 | 22 | 23 | 24 | 
| 25 | 26 | 27 | 28 | 1 | 30 | 
| 31 | 32 | 33 | 34 | 35 | 36 |   

Ввывод:    
| 1 | 3 | 2 | 4 | 5 | 6 | 
| -- | -- | -- | -- | -- | -- |
| 7 | 9 | 8 | 10 | 11 | 12 | 
| 13 | 15 | 14 | 16 | 17 | 18 | 
| 19 | 100 | -20 | 22 | 23 | 24 | 
| 25 | 27 | 26 | 28 | 1 | 30 | 
| 31 | 33 | 32 | 34 | 35 | 36 | 

Ввод:     
3    
| 1 | 1 | 2 |
| -- | -- | -- |
| 2 | 2 | 1 |
| 3 | 3 | 3 |    

Ввывод:
| 1 | 1 | 2 |
| -- | -- | -- |
| 2 | 2 | 1 |
| 3 | 3 | 3 |   

Код:
```с:src/lab15.c
#include <stdio.h>
#include <limits.h>
enum { maxn = 10 };
void matrix_input(int n, int (*m)[n]);
void matrix_output(int n, int (*m)[n]);
void matrix_shuffle(int n, int(*m)[n]);

int main(){
    int m[maxn][maxn];
    int n;
    scanf("%d", &n);
    matrix_input(n, (int (*)[n]) m);         
    matrix_shuffle(n, (int (*)[n]) m);
    matrix_output(n, (int (*)[n]) m); 
    return 0;
}
void matrix_input(int n, int (*m)[n]){
    for (int i = 0; i != n; ++i)
        for (int j = 0; j != n; ++j)
            scanf("%d", &m[i][j]);
}
void matrix_output(int n, int (*m)[n]){
    for (int i = 0; i != n; ++i){
        for (int j = 0; j != n; ++j)
            printf("%d ", m[i][j]);
        printf("\n");
     }
}

void matrix_shuffle(int n, int(*m)[n]){
    int sum = 0,max = INT_MIN, min = INT_MAX, max_column = 0, min_column = 0;
    for (int j = 0; j != n; ++j){
        sum = 0;
        for (int i = 0; i != n; ++i){
             sum += m[i][j];
        }
        if (max < sum){
            max = sum;
            max_column = j;
        }
        if (min > sum){
            min = sum;
            min_column = j;
        }
    }
    for (int i = 0;  i != n; ++i){
        int temp = m[i][max_column];
        m[i][max_column] = m[i][min_column];
        m[i][min_column] = temp;
    }
}

                                 
```
Пункты 1-7 отчета составляются строго до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________
### 8. **Протокол**
```
alexey@alexey-VirtualBox:~$ cat h.txt
4
1  2  3 4
5  6  7 8
9  10 11 12
13 14 15 16
alexey@alexey-VirtualBox:~$ gcc -std=c18 lab15.c
alexey@alexey-VirtualBox:~$ ./a.out < h.txt
4 2 3 1 
8 6 7 5 
12 10 11 9 
16 14 15 13 
alexey@alexey-VirtualBox:~$ cat h.txt
6
1 2 3 4 5 6
7 8 9 10 11 12
13 14 15 16 17 18
19 -20 100 22 23 24
25 26 27 28 1 30
31 32 33 34 35 36
alexey@alexey-VirtualBox:~$ ./a.out < h.txt
1 3 2 4 5 6 
7 9 8 10 11 12 
13 15 14 16 17 18 
19 100 -20 22 23 24 
25 27 26 28 1 30 
31 33 32 34 35 36 
alexey@alexey-VirtualBox:~$ cat h.txt
3
1 1 2
2 2 1
3 3 3
alexey@alexey-VirtualBox:~$ ./a.out < h.txt
1 1 2 
2 2 1 
3 3 3 
alexey@alexey-VirtualBox:~$ 

```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 08.12.22 | 17:00 | Выполнение лабораторной работы | - | - |    
## 10. Замечания автора по существу работы
По ходу защиты лабораторной работы было дано задание:
Задание: Вам даны два чётных целых числа n и m. Вам нужно найти любую бинарную матрицу a с n строками и m столбцами, в которой у каждой клетки (i,j) есть ровно две соседние со значениями, отличными от a<sub>i,j</sub>.
```с:src/protectlab15.c
#include <stdio.h>

enum { maxn = 100 };
void matrix();

int main (void) {
    matrix();
    return 0;
}
void matrix(){
    int m[maxn][maxn];
    int n, i, j;
    int two, repeat_1;
    scanf("%d", &n);
    for (int k = 0; k != n; ++k){
            scanf("%d", &i);
            scanf("%d", &j);
            two = 0;
            repeat_1 = 0;
            for (int x = 0; x != i; ++x){
                for (int y = 0; y != j; ++y){
                    if (two == 0){
                        m[x][y] = 0;
                        printf(" %d", m[x][y]);
                        two = 1;
                        continue;
                    }
                    else if (two == 1){
                        m[i][j] = 1;
                        printf(" %d", m[i][j]);
                        two = 2;
                        continue;
                    }
                    else if (two == 2){
                        m[x][y] = 1;
                        printf(" %d", m[x][y]);
                        two = 3;
                        continue;
                    }
                    else{
                        m[x][y] = 0;
                        printf(" %d", m[x][y]);
                        two = 0;
                        continue;
                    }                                          
                }
                printf("\n");
                if (repeat_1 < 2){
                    two = 2;
                    ++repeat_1;
                }
                else if (repeat_1 == 2){
                    two = 0;
                    ++repeat_1;
                }
                else if (repeat_1 == 3){
                    two = 0;
                    repeat_1 = 0;
                }
                     
            }
    }
        
}


```
## 11. Выводы
Была изучена работа с квадратными матрицами порядка NxN (1<=N<=8), вводимой из стандартного текстового файла, на языке Си.
  
<b>Подпись студента:</b> ____________________
