# **Отчёт по лабораторной работе № 12** по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Галкин Алексей Дмитриевич, № по списку 3</ins> 

<b>Контакты e-mail:</b> <ins>alexgalkin2004@mail.ru</ins>

<b>Работа выполнена:</b> «17» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>5</ins>

<b>Отчет сдан</b> «19» <ins>ноября<ins>2022</ins> г., <b>итоговая оценка</b> <ins>5 (отлично)</ins>

<b>Подпись преподавателя:</b> ________________  

## 1. Тема
Техника работы с целыми числами. Системы счисления.

## 2. Цель работы
Составить программу на языке Си, выполняющую анализ и обработку вводимого текста в соответствии с выданным вариантом задания
## 3. Задание (Вариант №3)
Выбрать идущие подряд тройки цифр, упорядоченных по возрастанию.
## 4. Оборудование
<b>Процессор:</b> 11th Gen Intel(R) Core (TM) i7-11370H 3.30GHz<br/>
<b>ОП: 16ГБ <br/>
<b>Монитор: 2880x1800 <br/>
## 5. Програмное обеспечение
<b>Опереционная система семейства: VirtualBox 6.1.38 - Ubuntu 22.04.01 LTS<br/>
<b>Интерпретатор команд:</b> bash, версия 5.1.16<br/>
<b>Система программирования:</b> --, версия --<br/>  
<b>Редактор текстов:</b> emacs, версия **28.2**<br/>
<b>Утилиты операционной системы:</b> gcc,cat<br/>
<b>Прикладные системы и программы:</b>--<br/>
<b>Местанохождение и имена файлов программ и данных на домашнем компьютере:</b> home/alexey<br/>
## 6. Идея, метод, алгоритм
1. Создаём три структуры с тремя элементами и три состояния (ZERO, ONE, TWO).
2. В каждом состоянии заносим элемент c в структуру.
3. На выводе проверяем, чтобы числа в каждой структуре были упорядочены по возрастанию.
## 7. Сценарий выполнения работы
1. Скомпилируем при помощи команды gcc программу lab11.c.
2. Компилятор сообщит об ошибке, если она присутствует.
3. Запустим файл a.out через команду ./a.out.
4. Введём любой ряд чисел
Тесты: 
  
| № | Ввод | Вывод |
| ------ | ------ | ------ |
| 1 | 123456 |= 1 2 3 = 2 3 4 = 3 4 5 = 4 5 6 |
| 2 | 21345267 |= 1 3 4 = 3 4 5 = 2 6 7 |
| 3 | 12 |  |
| 1 | 8766789 |= 6 7 8 = 7 8 9 |

Код:
```
#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>
typedef struct{
    char i, j, l;
}three;
enum State {
    ZERO,
    ONE,
    TWO
};
int Digit_count ();

int main () {
    printf("%c\n", Digit_count());
    return 0;
    }
int Digit_count () {
    char c;
    enum State state = ZERO;
    int t = 0, a = 0, b = 0, g = 0, m = 0;
    three q = {0, 0, 0};
    three s = {0, 0, 0};
    three y = {0, 0, 0};
    for (c = getchar(); c != EOF; c = getchar()){
        switch (state) {
            case ZERO:
                if ((isdigit(c) != 0)){
                    t = 0;
                    q.i = c;
                    if ((b == 1)){
                        s.l = c;
                        b = 2;
                    }
                    if ((int) y.i < (int) c){
                        y.j = c;
                        m = 2;
                    }
                    if ((b == 2) & (isdigit(s.i) != 0) & (s.i < s.j) & (s.j < s.l)){
                        printf("%c%c%c\n", s.i, s.j, s.l);
                        b = 0;
                        s.i = 0;
                        s.j = 0;
                        s.l = 0;
                    }  
                    state = ONE;
                }
                break;
           case ONE:
               b = 0;
               s.i = c;
               q.j = c;
               state = TWO;
               if ((m == 2)){
                   m = 3;
                   y.l = c;
               }
               if ((m == 3) & (isdigit(y.i) != 0) & (y.i < y.j) & (y.j < y.l)){
                   printf("%c%c%c\n", y.i, y.j, y.l);
                   m = 0;
                   y.i = 0;
                   y.j = 0;
                   y.l = 0;
               }
               
               break;
          case TWO:
                y.i = c;
                m = 1;
                q.l = c;
                t = 1;
                if ((isdigit(q.i) != 0) & (q.i < q.j) & (q.j < q.l)){
                    printf("%c%c%c\n", q.i, q.j, q.l);
                    t = 0;
                    q.i = 0;
                    q.j = 0;
                    q.l = 0;
                }
                state = ZERO;
                if ((int) s.i < (int) c){
                    s.j = c;
                    b = 1;
                } 
                break;
        }
    }
    return 0;
}
                                  
```
Пункты 1-7 отчета составляются строго до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя</b> ________________
### 8. **Протокол**
```
alexey@alexey-VirtualBox:~$ gcc -std=c18 lab12.c
alexey@alexey-VirtualBox:~$ ./a.out
123456
= 1 2 3 = 2 3 4 = 3 4 5 = 4 5 6 ^Z
[81]+  Остановлен    ./a.out
alexey@alexey-VirtualBox:~$ ./a.out
21345267
= 1 3 4 = 3 4 5 = 2 6 7 ^Z
[82]+  Остановлен    ./a.out
alexey@alexey-VirtualBox:~$ ./a.out
12
^Z
[83]+  Остановлен    ./a.out
alexey@alexey-VirtualBox:~$ ./a.out
8766789
= 6 7 8 = 7 8 9 ^Z
[84]+  Остановлен    ./a.out
alexey@alexey-VirtualBox:~$
```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 19.11.22 | 13:00 | Выполнение лабораторной работы | - | - |    
## 10. Замечания автора по существу работы
—
## 11. Выводы
Была изучена работа с целыми числами на языке Си.
  
